louis35791/stm32f7xx_grbl/Core/Src/step.c
#include <string.h>
#include <limits.h>
#include "stm32f7xx_hal.h"
#include "stm32f7xx_grbl.h"
#include "stm32f7xx_timer_extension.h"
#include "FreeRTOS.h"
#include "task.h"
#include "step.h"

#define PULSE_FREQ 300000  // Hz
#define HALF_PERIOD 0x7FFF // 0xFFFF / 2
#define RING_BUFFER_SIZE 4

/**
 * Type Defines
 */
typedef struct TIM_DMA_Parameters
{
    TIM_HandleTypeDef *htim;
    uint8_t TIM_DMA_ID;
    uint8_t TIM_DMA_ID_CC;
    uint8_t TIM_CHANNEL;
    doubleBufferArray_t *preparedBuffer;
    doubleBufferArray_t *preparingBuffer;
    uint32_t lastCounterValue;
    uint32_t secondLastCounterValue;
    uint16_t lengthAvailableData;
} TIM_DMA_Parameters_t;

typedef struct
{
    TIM_DMA_Parameters_t pulse;
    TIM_DMA_Parameters_t dir;
} Axis_TIM_DMA_Parameters_t;

typedef struct
{
    doubleBufferArray_t pulse[2];
    doubleBufferArray_t dir[2];
} AxisBuffer_t;

/**
 * Declare Variables
 */
// Ring buffer for each axis
DEFINE_RING_BUFFER(x, RING_BUFFER_SIZE);
DEFINE_RING_BUFFER(y, RING_BUFFER_SIZE);
DEFINE_RING_BUFFER(z, RING_BUFFER_SIZE);

// ring buffer head and tail for each axis
volatile uint16_t ringBufferHead[NUM_DIMENSIONS] = {0};
volatile uint16_t ringBufferTail[NUM_DIMENSIONS] = {0};

// declare an array of timer and DMA parameters for each axis
static Axis_TIM_DMA_Parameters_t axisTimerDMAParams[NUM_DIMENSIONS];

// declare an array of buffer for each axis
static AxisBuffer_t axisBuffer[NUM_DIMENSIONS];

// declare an array of general notification
volatile uint32_t generalNotification;

// threshold for determining whether to batch update pulse data.
volatile uint32_t updateBatchThreshold = 0;
volatile uint32_t nextUpdateBatchThreshold = 0;

// increment for pulse
volatile uint16_t increment = 0;

// counter overruns the batch update threshold
volatile uint8_t overrun = 0;

// capture compare register value
volatile uint16_t captureCompareReg = 0;

/**
 * Function Prototypes
 */
static void TIM_DMADelayPulseCplt(DMA_HandleTypeDef *hdma);
void stepUpdateBuffer(doubleBufferArray_t *buffer, uint32_t start_index, uint32_t start_value, uint32_t increment, size_t length);
HAL_StatusTypeDef stepTimeOCStartDMA(TIM_HandleTypeDef *htim, uint32_t Channel, const uint32_t *pData, uint16_t Length);
uint16_t stepRingBufferGetNext(axis_t axis);
void stepRingBufferIncrementHead(axis_t axis);
uint16_t stepRingBufferGetTail(axis_t axis);
void stepRingBufferIncrementTail(axis_t axis);
uint32_t stepGetFreeDataAddress(axis_t axis);
uint32_t stepGetAvailableDataAddress(axis_t axis);

/* ============================= */
/* === Function Declarations === */
/* ============================= */
// initialization of step function
void stepInit(void)
{
    // initialize axis parameters
    // INIT_TIM_DMA_PARAMETERS(axisTimerDMAParams, X_AXIS);
    // INIT_TIM_DMA_PARAMETERS(axisTimerDMAParams, Y_AXIS);
    // INIT_TIM_DMA_PARAMETERS(axisTimerDMAParams, Z_AXIS);
}

// handler for step task
void stepTask(void *pvParameters)
{
    // initialize step function
    stepInit();

    // set PD3 to high to enable level shifter
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_3, GPIO_PIN_SET);

    // compute increment for pulse
    // increment = COMPUTE_INCREMENT_FOR_PULSE(1000, APB1_TIMER_CLOCK);
    increment = COMPUTE_INCREMENT_FOR_PULSE(PULSE_FREQ, APB1_TIMER_CLOCK);

    /**
     * Prepare buffer for each axis in a reverse order
     * to ensure that all the slave timers are ready
     * before the master timer starts.
     */
    for (int8_t i = NUM_DIMENSIONS - 1; i >= 0; i--)
    {
        // update all buffer data in ring buffer except the last one
        for (uint16_t j = 0; j < RING_BUFFER_SIZE - 1; j++)
        {
            // put data into ring buffer head
            doubleBufferArray_t *pulseBuffer = stepGetFreeDataAddress(i);

            if (pulseBuffer == 0)
                Error_Handler();

            // update pulse data
            stepUpdateBuffer(pulseBuffer, 0, 10, increment, DOUBLE_BUFFER_SIZE);

            // increment ring buffer head
            stepRingBufferIncrementHead(i);
        }

        // get timer and DMA parameters of this axis
        TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[i].pulse;
        TIM_DMA_Parameters_t *timDMAParamsDir = &axisTimerDMAParams[i].dir;

        // update pulse data
        stepUpdateBuffer(&axisBuffer[i].pulse[0], 0, 10, increment, DOUBLE_BUFFER_SIZE);

        // update dir data
        stepUpdateBuffer(&axisBuffer[i].dir[0], 0, 10 + (increment / 2), increment, DOUBLE_BUFFER_SIZE);

        // set prepared buffer
        timDMAParamsPulse->preparedBuffer = &axisBuffer[i].pulse[0];
        timDMAParamsDir->preparedBuffer = &axisBuffer[i].dir[0];

        // set preparing buffer
        timDMAParamsPulse->preparingBuffer = &axisBuffer[i].pulse[1];
        timDMAParamsDir->preparingBuffer = &axisBuffer[i].dir[1];

        // set last counter value
        timDMAParamsPulse->lastCounterValue = axisBuffer[i].pulse[0][DOUBLE_BUFFER_SIZE - 1];
        timDMAParamsDir->lastCounterValue = axisBuffer[i].dir[0][DOUBLE_BUFFER_SIZE - 1];

        // set batch update threshold
        if (i == 0)
            updateBatchThreshold = timDMAParamsDir->lastCounterValue;

        // reset timer counter
        __HAL_TIM_SET_COUNTER(timDMAParamsPulse->htim, 0);
        __HAL_TIM_SET_COUNTER(timDMAParamsDir->htim, 0);

        // set length available data
        timDMAParamsPulse->lengthAvailableData = DOUBLE_BUFFER_SIZE;
        timDMAParamsDir->lengthAvailableData = DOUBLE_BUFFER_SIZE;

        // set compare value to the first element of the buffer in timer
        __HAL_TIM_SET_COMPARE(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_CHANNEL, axisBuffer[i].pulse[0][0]);
        __HAL_TIM_SET_COMPARE(timDMAParamsDir->htim, timDMAParamsDir->TIM_CHANNEL, axisBuffer[i].dir[0][0]);

        // start timer output compare mode with DMA
        stepTimeOCStartDMA(timDMAParamsPulse->htim, (uint32_t)timDMAParamsPulse->TIM_CHANNEL, ((uint32_t *)(timDMAParamsPulse->preparedBuffer) + 1), timDMAParamsPulse->lengthAvailableData - 1);
        stepTimeOCStartDMA(timDMAParamsDir->htim, (uint32_t)timDMAParamsDir->TIM_CHANNEL, ((uint32_t *)(timDMAParamsDir->preparedBuffer) + 1), timDMAParamsDir->lengthAvailableData - 1);
        __HAL_TIM_ENABLE(timDMAParamsPulse->htim);
    }

    // compute increment for pulse
    increment = COMPUTE_INCREMENT_FOR_PULSE(PULSE_FREQ, APB1_TIMER_CLOCK);

