louis35791/stm32f7xx_grbl/Core/Src/step.c
    // Infinite loop
    for (;;)
    {
        /**
         * Batch update pulse data for all axes
         */
        // check if buffer shall be updated
        if ((generalNotification & GENERAL_NOTIFICATION_DATA_READY) == 0)
        {
            // set PD4 to high ===> signal the start of updating buffer
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_SET);

            for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
            {
                // get timer and DMA parameters of this axis
                TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[i].pulse;
                TIM_DMA_Parameters_t *timDMAParamsDir = &axisTimerDMAParams[i].dir;

                // set length of available data
                timDMAParamsPulse->lengthAvailableData = DOUBLE_BUFFER_SIZE;
                timDMAParamsDir->lengthAvailableData = DOUBLE_BUFFER_SIZE;

                // update pulse data
                stepUpdateBuffer(timDMAParamsPulse->preparingBuffer, 0, timDMAParamsPulse->lastCounterValue + increment, increment, timDMAParamsPulse->lengthAvailableData);
                stepUpdateBuffer(timDMAParamsDir->preparingBuffer, 0, timDMAParamsDir->lastCounterValue + increment, increment, timDMAParamsDir->lengthAvailableData);

                // set last counter value
                timDMAParamsPulse->lastCounterValue = (*timDMAParamsPulse->preparingBuffer)[timDMAParamsPulse->lengthAvailableData - 1];
                timDMAParamsDir->lastCounterValue = (*timDMAParamsDir->preparingBuffer)[timDMAParamsDir->lengthAvailableData - 1];

                // set batch update threshold
                if (i == 0)
                    nextUpdateBatchThreshold = timDMAParamsDir->lastCounterValue;
            }

            // set notification to data ready
            generalNotification |= GENERAL_NOTIFICATION_DATA_READY;

            // set PD4 to low ===> signal the end of updating buffer
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_4, GPIO_PIN_RESET);
        }
        // check if there is a notification to resume DMA stream asking from the timer interrupt
        else if (generalNotification & GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE)
        {
            // set PD5 to high ===> signal the start of resuming DMA stream from task
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_5, GPIO_PIN_SET);

            // resume DMA stream with updated buffer and length for each axis
            for (uint8_t i = 0; i < NUM_DIMENSIONS; i++)
            {
                // get timer and DMA parameters of this axis
                TIM_DMA_Parameters_t *timDMAParamsPulse = &axisTimerDMAParams[i].pulse;
                TIM_DMA_Parameters_t *timDMAParamsDir = &axisTimerDMAParams[i].dir;

                // swap buffer
                SWAP_BUFFER_UINT32(timDMAParamsPulse->preparedBuffer, timDMAParamsPulse->preparingBuffer);
                SWAP_BUFFER_UINT32(timDMAParamsDir->preparedBuffer, timDMAParamsDir->preparingBuffer);

                // check if counter matches compare value
                if (overrun)
                {
                    // set counter to capture compare register + 1
                    __HAL_TIM_SET_COUNTER(timDMAParamsPulse->htim, captureCompareReg + 1);
                }

                // set compare value to the first element of the buffer in timer
                // __HAL_TIM_SET_COMPARE(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_CHANNEL, (*timDMAParamsPulse->preparedBuffer)[0]);

                // resume DMA stream with updated buffer and length
                RESUME_DMA_STREAM_WITH_TC(timDMAParamsPulse->htim->hdma[timDMAParamsPulse->TIM_DMA_ID], timDMAParamsPulse->preparedBuffer, timDMAParamsPulse->lengthAvailableData - 1);
                RESUME_DMA_STREAM_WITH_TC(timDMAParamsDir->htim->hdma[timDMAParamsDir->TIM_DMA_ID], timDMAParamsDir->preparedBuffer, timDMAParamsDir->lengthAvailableData);
            }
            // set batch update threshold with the next batch update threshold
            updateBatchThreshold = nextUpdateBatchThreshold;

            // restart counter
            TIM_START_COUNTER(MASTER_TIM);

            // reset the notification
            generalNotification &= ~GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE;

            // set PD5 to low ===> signal the end of resuming DMA stream from task
            HAL_GPIO_WritePin(GPIOD, GPIO_PIN_5, GPIO_PIN_RESET);
        }
    }
}

/**
 * @brief Update double buffer with increment value
 */
void stepUpdateBuffer(doubleBufferArray_t *buffer, uint32_t start_index, uint32_t start_value, uint32_t increment, size_t length)
{
    for (uint16_t i = start_index; i < start_index + length; i++)
    {
        (*buffer)[i] = (uint32_t)(start_value + increment * (i - start_index));
    }
}

/**
 * @brief  Starts the TIM Output Compare signal generation in DMA mode.
 * @param  htim TIM Output Compare handle
 * @param  Channel TIM Channel to be enabled
 *          This parameter can be one of the following values:
 *            @arg TIM_CHANNEL_1: TIM Channel 1 selected
 *            @arg TIM_CHANNEL_2: TIM Channel 2 selected
 *            @arg TIM_CHANNEL_3: TIM Channel 3 selected
 *            @arg TIM_CHANNEL_4: TIM Channel 4 selected
 * @param  pData The source Buffer address.
 * @param  Length The length of data to be transferred from memory to TIM peripheral
 * @retval HAL status
 */
HAL_StatusTypeDef stepTimeOCStartDMA(TIM_HandleTypeDef *htim, uint32_t Channel, const uint32_t *pData,
                                     uint16_t Length)
{
    HAL_StatusTypeDef status = HAL_OK;
    //   uint32_t tmpsmcr;

    /* Check the parameters */
    assert_param(IS_TIM_CCX_INSTANCE(htim->Instance, Channel));

    /* Set the TIM channel state */
    if (TIM_CHANNEL_STATE_GET(htim, Channel) == HAL_TIM_CHANNEL_STATE_BUSY)
    {
        return HAL_BUSY;
    }
    else if (TIM_CHANNEL_STATE_GET(htim, Channel) == HAL_TIM_CHANNEL_STATE_READY)
    {
        if ((pData == NULL) || (Length == 0U))
        {
            return HAL_ERROR;
        }
        else
        {
            TIM_CHANNEL_STATE_SET(htim, Channel, HAL_TIM_CHANNEL_STATE_BUSY);
        }
    }
    else
    {
        return HAL_ERROR;
    }

    switch (Channel)
    {
    case TIM_CHANNEL_1:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC1]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC1]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC1]->XferErrorCallback = TIM_DMAError;

        /* Enable the DMA stream */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC1], (uint32_t)pData, (uint32_t)&htim->Instance->CCR1,
                             Length) != HAL_OK)
        {
            /* Return error status */
            return HAL_ERROR;
        }

        /* Enable the TIM Capture/Compare 1 DMA request */
        __HAL_TIM_ENABLE_DMA(htim, TIM_DMA_CC1);
        break;
    }

    case TIM_CHANNEL_2:
    {
        /* Set the DMA compare callbacks */
        htim->hdma[TIM_DMA_ID_CC2]->XferCpltCallback = TIM_DMADelayPulseCplt;
        htim->hdma[TIM_DMA_ID_CC2]->XferHalfCpltCallback = TIM_DMADelayPulseHalfCplt;

        /* Set the DMA error callback */
        htim->hdma[TIM_DMA_ID_CC2]->XferErrorCallback = TIM_DMAError;

        /* Enable the DMA stream */
        if (HAL_DMA_Start_IT(htim->hdma[TIM_DMA_ID_CC2], (uint32_t)pData, (uint32_t)&htim->Instance->CCR2,
                             Length) != HAL_OK)
        {
            /* Return error status */
            return HAL_ERROR;
        }

