louis35791/stm32f7xx_grbl/Core/Src/step.c
            // swap buffer
            SWAP_BUFFER_UINT32(timDMAParamsPulse->preparedBuffer, timDMAParamsPulse->preparingBuffer);
            SWAP_BUFFER_UINT32(timDMAParamsDir->preparedBuffer, timDMAParamsDir->preparingBuffer);

            // check if counter matches compare value
            if (overrun)
            {
                // set counter to capture compare register + 1
                __HAL_TIM_SET_COUNTER(timDMAParamsPulse->htim, captureCompareReg + 1);
            }

            // set compare value to the first element of the buffer in timer
            // __HAL_TIM_SET_COMPARE(timDMAParamsPulse->htim, timDMAParamsPulse->TIM_CHANNEL, (*timDMAParamsPulse->preparedBuffer)[0]);

            // resume DMA stream with updated buffer and length
            // RESUME_DMA_STREAM_WITH_TC(timDMAParamsPulse->htim->hdma[timDMAParamsPulse->TIM_DMA_ID], ((uint32_t *)(timDMAParamsPulse->preparedBuffer) + 1), timDMAParamsPulse->lengthAvailableData - 1);
            RESUME_DMA_STREAM_WITH_TC(timDMAParamsPulse->htim->hdma[timDMAParamsPulse->TIM_DMA_ID], timDMAParamsPulse->preparedBuffer, timDMAParamsPulse->lengthAvailableData);
            RESUME_DMA_STREAM_WITH_TC(timDMAParamsDir->htim->hdma[timDMAParamsDir->TIM_DMA_ID], timDMAParamsDir->preparedBuffer, timDMAParamsDir->lengthAvailableData);
        }
        // set batch update threshold with the next batch update threshold
        updateBatchThreshold = nextUpdateBatchThreshold;

        // restart counter
        TIM_START_COUNTER(MASTER_TIM);

        // reset the notification
        generalNotification &= ~GENERAL_NOTIFICATION_DATA_READY;

        // set PD7 to low ===> signal the end of updating DMA buffer
        HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_RESET);
    }
    else
    {
        // notify main task to update pulse data
        generalNotification |= GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE;
    }

    // set PD6 to low ===> signal the end of ISR
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_RESET);
}

/**
 * Double Bufffer Mode Callback - M0 Transfer Complete
 */
void PingPongM0TransferCompleteCallback(TIM_HandleTypeDef *htim)
{
    // set PD6 to high ===> signal the start of ISR
    axis_t axis = GET_AXIS_FROM_TIM_HANDLE(htim);

    if (axis == NUM_DIMENSIONS)
        return;

    uint32_t address = stepGetAvailableDataAddress(axis);

    if (address == 0) // no data available
    {
        // stop counter
        TIM_STOP_COUNTER(MASTER_TIM); // timer x axis

        // set notification to data not available
        generalNotification |= GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE;

        return;
    }

    // update M0 buffer address
    htim->hdma[GET_TIM_DMA_ID_FROM_AXIS(axis)]->Instance->M0AR = address;

    // set PD6 to low ===> signal the end of ISR
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_6, GPIO_PIN_RESET);
}

/**
 * Double Bufffer Mode Callback - M1 Transfer Complete
 */
void PingPongM1TransferCompleteCallback(TIM_HandleTypeDef *htim)
{
    // set PD7 to high ===> signal the start of ISR
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_SET);

    axis_t axis = GET_AXIS_FROM_TIM_HANDLE(htim);

    if (axis == NUM_DIMENSIONS)
        return;

    uint32_t address = stepGetAvailableDataAddress(axis);

    if (address == 0) // no data available
    {
        // stop counter
        TIM_STOP_COUNTER(MASTER_TIM); // timer x axis

        // set notification to data not available
        generalNotification |= GENERAL_NOTIFICATION_DATA_NOT_AVAILABLE;

        return;
    }

    // update M1 buffer address
    htim->hdma[GET_TIM_DMA_ID_FROM_AXIS(axis)]->Instance->M1AR = address;

    // set PD7 to low ===> signal the end of ISR
    HAL_GPIO_WritePin(GPIOD, GPIO_PIN_7, GPIO_PIN_RESET);
}

/**
 * Ring Buffer Manipulation Functions
 */
uint16_t stepRingBufferGetNext(axis_t axis)
{
    switch (axis)
    {
    case X_AXIS:
        RING_BUFFER_GET_NEXT(x, RING_BUFFER_SIZE);
    case Y_AXIS:
        RING_BUFFER_GET_NEXT(y, RING_BUFFER_SIZE);
    case Z_AXIS:
        RING_BUFFER_GET_NEXT(z, RING_BUFFER_SIZE);
    case NUM_DIMENSIONS:
    default:
        return UINT16_MAX;
    }
}

void stepRingBufferIncrementHead(axis_t axis)
{
    switch (axis)
    {
    case X_AXIS:
        RING_BUFFER_INCREMENT_HEAD(x, RING_BUFFER_SIZE);
        break;
    case Y_AXIS:
        RING_BUFFER_INCREMENT_HEAD(y, RING_BUFFER_SIZE);
        break;
    case Z_AXIS:
        RING_BUFFER_INCREMENT_HEAD(z, RING_BUFFER_SIZE);
        break;
    case NUM_DIMENSIONS:
    default:
        break;
    }
}

uint16_t stepRingBufferGetTail(axis_t axis)
{
    switch (axis)
    {
    case X_AXIS:
        RING_BUFFER_GET_TAIL(x);
    case Y_AXIS:
        RING_BUFFER_GET_TAIL(y);
    case Z_AXIS:
        RING_BUFFER_GET_TAIL(z);
    case NUM_DIMENSIONS:
    default:
        return UINT16_MAX;
    }
}

void stepRingBufferIncrementTail(axis_t axis)
{
    switch (axis)
    {
    case X_AXIS:
        RING_BUFFER_INCREMENT_TAIL(x, RING_BUFFER_SIZE);
        break;
    case Y_AXIS:
        RING_BUFFER_INCREMENT_TAIL(y, RING_BUFFER_SIZE);
        break;
    case Z_AXIS:
        RING_BUFFER_INCREMENT_TAIL(z, RING_BUFFER_SIZE);
        break;
    case NUM_DIMENSIONS:
    default:
        break;
    }
}

/**
 * Get the free data address
 * @param axis Axis to get the free data address
 * @return Free data address; 0 if no data available
*/
uint32_t stepGetFreeDataAddress(axis_t axis)
{
    if (stepRingBufferGetNext(axis) == UINT16_MAX)
        return 0;
    
    uint32_t address = 0;

    switch (axis)
    {
    case X_AXIS:
        address = (uint32_t)(xPulseBuffer[xRingBufferHead]);
    case Y_AXIS:
        address = (uint32_t)(yPulseBuffer[yRingBufferHead]);
    case Z_AXIS:
        address = (uint32_t)(zPulseBuffer[zRingBufferHead]);
    case NUM_DIMENSIONS:
    default:
        return 0;
    }

    stepRingBufferIncrementHead(axis);

    return address;
}

/**
 * Get the available data address
 * @param axis Axis to get the available data address
 * @return Available data address; 0 if no data available
 */
uint32_t stepGetAvailableDataAddress(axis_t axis)
{
    uint16_t tail = stepRingBufferGetTail(axis);

    if (tail == UINT16_MAX)
        return 0;

    stepRingBufferIncrementTail(axis);

    switch (axis)
    {
    case X_AXIS:
        return (uint32_t)(CONCATENATE(x, PulseBuffer))[tail];
    case Y_AXIS:
        return (uint32_t)(CONCATENATE(y, PulseBuffer))[tail];
    case Z_AXIS:
        return (uint32_t)(CONCATENATE(z, PulseBuffer))[tail];
    case NUM_DIMENSIONS:
    default:
        return 0;
    }
}